app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(params[:comment])
    @comment.post_id = params[:post_id]

    respond_to do |format|
      if @comment.save
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`name`, `created_at`, `updated_at`, `post_id`, `message`, `email`) VALUES('dfsg', '2009-02-27 03:26:08', '2009-02-27 03:26:08', 1, 'fasdfsadfsd', 'sadfsad')